# 1. Задание
# Поработайте с переменными, создайте несколько, выведите на экран.
# Запросите у пользователя некоторые числа и строки и сохраните в переменные, затем выведите на экран.

a = 5
b = 6
c = a * 6
print(a, '*', b, '=', c)

d = input('Введите целое число:')
print(d)

s = input('Введите строку:')
print(s)
